insomnolence/esp32-pixel-node/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Button Interface Configuration for ESP32-S3
CONFIG_BUTTON_INTERFACE_ENABLED=y
CONFIG_BUTTON_1_GPIO=0
CONFIG_BUTTON_2_GPIO=1
CONFIG_BUTTON_DEBOUNCE_MS=50
